pang623/PIC18simulator/test/test_PIC18sim.c
#include "unity.h"
#include "PIC18sim.h"

extern int8_t fileRegisters[];

void setUp(void)
{
}

void tearDown(void)
{
}

void test_add_given_0x1C_and_0xFE_expect_N0_OV0_Z0_DC1_C1() {
  status = STATUS_N | STATUS_Z |STATUS_OV;
  int val = add(0x1C, 0xFE);
  TEST_ASSERT_EQUAL(val, 0x1C + 0xFE);
  TEST_ASSERT_EQUAL_HEX8(STATUS_DC | STATUS_C, status);
}

void test_add_given_0x84_and_0x79_expect_N1_OV0_Z0_DC0_C0() {
  status = STATUS_DC | STATUS_Z | STATUS_C | STATUS_OV;
  int val = add(0x84, 0x79);
  TEST_ASSERT_EQUAL(val, 0x84 + 0x79);
  TEST_ASSERT_EQUAL_HEX8(STATUS_N, status);
}

void test_add_given_0x7C_and_0x64_expect_N1_OV1_Z0_DC1_C0() {
  status = STATUS_Z | STATUS_C;
  int val = add(0x7C, 0x64);
  TEST_ASSERT_EQUAL(val, 0x7C + 0x64);
  TEST_ASSERT_EQUAL_HEX8(STATUS_N | STATUS_DC | STATUS_OV, status);
}

void test_add_given_0x80_and_0x80_expect_N0_OV1_Z1_DC0_C1() {
  status = STATUS_N | STATUS_DC;
  int val = add(0x80, 0x80);
  TEST_ASSERT_EQUAL(val, 0x80 + 0x80);
  TEST_ASSERT_EQUAL_HEX8(STATUS_Z | STATUS_C | STATUS_OV, status);
}

void test_add_given_0x00_and_0x00_expect_N0_OV0_Z1_DC0_C0() {
  status = STATUS_N | STATUS_DC | STATUS_OV | STATUS_C;
  int val = add(0x00, 0x00);
  TEST_ASSERT_EQUAL(val, 0x00 + 0x00);
  TEST_ASSERT_EQUAL_HEX8(STATUS_Z, status);
}

//----------------------------TEST ADDWF---------------------------------

/*
Direction     (d):    0 ==> WREG , 1 ==> file register
Bank          (a):    0 ==> ACCESS BANK, 1 ==> BANKED
File Register (f):    range from 0 to 255
*/

//addwf   0x45, f, ACCESS   ==> 0010 0110 0100 0101(0x2645)
void test_executeInstruction_given_0x2645_expect_addwf_called_and_access_to_0x45_with_the_result_stored_in_fileRegister(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x45, 0x26, 0x00, 0xff};
  //Set WREG
  wreg = 0x23;
  //Set content of target file reg
  fileRegisters[0x45] = 0x56;
  fileRegisters[0x245] = 0x00;
  fileRegisters[0xF45] = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array address
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x79, fileRegisters[0x45]);
  TEST_ASSERT_EQUAL_HEX8(0x23, wreg);
  TEST_ASSERT_EQUAL_HEX8(0x00, status);
}

//addwf   0x23, w, ACCESS   ==> 0010 0100 0010 0011(0x2423)
void test_executeInstruction_given_0x2423_expect_addwf_called_and_access_to_0x23_with_the_result_stored_in_wreg(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x23, 0x24, 0x00, 0xff};
  //Set WREG
  wreg = 0x38;
  //Set content of target file reg
  fileRegisters[0x23] = 0x6A;
  fileRegisters[0x723] = 0x00;
  fileRegisters[0xF23] = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array address
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x6A, fileRegisters[0x23]);
  TEST_ASSERT_EQUAL_HEX8(0xA2, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_OV | STATUS_N | STATUS_DC, status);
}

//  0010 01da ffff ffff
//addwf   0x67, f, ACCESS   ==> 0010 0110 0110 0111(0x2667)
void test_executeInstruction_given_0x2667_expect_addwf_called_and_access_to_0xf67_with_the_result_stored_in_fileRegister(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x67, 0x26, 0x00, 0xff};
  //Set WREG
  wreg = 0x56;
  //Set content of target file reg
  fileRegisters[0x67]  = 0x00;
  fileRegisters[0x467] = 0x00;
  fileRegisters[0xf67] = 0x43;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x99, fileRegisters[0xf67]);
  TEST_ASSERT_EQUAL_HEX8(0x56, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_OV | STATUS_N, status);
}

//  0010 01da ffff ffff
//addwf   0x8F, w, ACCESS   ==> 0010 0100 1000 1111(0x248F)
void test_executeInstruction_given_0x248F_expect_addwf_called_and_access_to_0xf8f_with_the_result_stored_in_wreg(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x8F, 0x24, 0x00, 0xff};
  //Set WREG
  wreg = 0x5B;
  //Set content of target file reg
  fileRegisters[0x8F]  = 0x00;
  fileRegisters[0x78F] = 0x00;
  fileRegisters[0xF8F] = 0x32;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x32, fileRegisters[0xF8F]);
  TEST_ASSERT_EQUAL_HEX8(0x8D, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_OV | STATUS_N, status);
}


//  0010 01da ffff ffff
//addwf   0xA5, f, BANKED   ==> 0010 0111 1010 0101(0x27A5)
void test_executeInstruction_given_0x27A5_expect_addwf_called_and_access_to_0x8A5_with_the_result_stored_in_fileRegister(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0xA5, 0x27, 0x00, 0xff};
  //Set BSR
  bsr = 0x8;
  //Set WREG
  wreg = 0x9C;
  //Set content of target file reg
  fileRegisters[0xA5]  = 0x00;
  fileRegisters[0x8A5] = 0xA9;
  fileRegisters[0xFA5] = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x45, fileRegisters[0x8A5]);
  TEST_ASSERT_EQUAL_HEX8(0x9C, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_C | STATUS_DC | STATUS_OV, status);
}

//  0010 01da ffff ffff
//addwf   0x7D, w, BANKED   ==> 0010 0101 0111 1101(0x257D)
void test_executeInstruction_given_0x257D_expect_addwf_called_and_access_to_0xB7D_with_the_result_stored_in_wreg(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x7D, 0x25, 0x00, 0xff};
  //Set BSR
  bsr = 0xB;
  //Set WREG
  wreg = 0xF9;
  //Set content of target file reg
  fileRegisters[0x7D]  = 0x00;
  fileRegisters[0xB7D] = 0xD8;
  fileRegisters[0xF7D] = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xD8, fileRegisters[0xB7D]);
  TEST_ASSERT_EQUAL_HEX8(0xD1, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_C | STATUS_N | STATUS_DC, status);
}

//----------------------------TEST INCF---------------------------------

