pang623/PIC18simulator/test/test_PIC18sim.c
/*
Direction     (d):    0 ==> WREG , 1 ==> file register
Bank          (a):    0 ==> ACCESS BANK, 1 ==> BANKED
File Register (f):    range from 0 to 255
*/

//  0010 10da ffff ffff
//incf   0x10, f, ACCESS   ==> 0010 1010 0001 0000(0x2A10)
void test_executeInstruction_given_0x2A10_expect_incf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x10, 0x2A, 0x00, 0xff};
  //Set WREG
  wreg = 0x22;
  //Set content of target file reg
  fileRegisters[0x10]  = 0xFF;
  fileRegisters[0xB10] = 0x00;
  fileRegisters[0xF10] = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x00, fileRegisters[0x10]);
  TEST_ASSERT_EQUAL_HEX8(0x22, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_C | STATUS_DC | STATUS_Z, status);
}

//  0010 10da ffff ffff
//incf   0x4D, w, ACCESS   ==> 0010 1000 0100 1101(0x284D)
void test_executeInstruction_given_0x284D_expect_incf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x4D, 0x28, 0x00, 0xff};
  //Set WREG
  wreg = 0x67;
  //Set content of target file reg
  fileRegisters[0x4D]  = 0xDA;
  fileRegisters[0xC4D] = 0x00;
  fileRegisters[0xF4D] = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xDA, fileRegisters[0x4D]);
  TEST_ASSERT_EQUAL_HEX8(0xDB, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_N, status);
}

//  0010 01da ffff ffff
//incf   0xA9, f, ACCESS   ==> 0010 1010 1010 1001(0x2AA9)
void test_executeInstruction_given_0x2AA9_expect_incf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0xA9, 0x2A, 0x00, 0xff};
  //Set WREG
  wreg = 0x9F;
  //Set content of target file reg
  fileRegisters[0xA9]  = 0x00;
  fileRegisters[0x4A9] = 0x00;
  fileRegisters[0xFA9] = 0xBF;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xC0, fileRegisters[0xFA9]);
  TEST_ASSERT_EQUAL_HEX8(0x9F, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_DC | STATUS_N, status);
}

//  0010 01da ffff ffff
//incf   0xCD, w, ACCESS   ==> 0010 1000 1100 1101(0x28CD)
void test_executeInstruction_given_0x28CD_expect_incf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0xCD, 0x28, 0x00, 0xff};
  //Set WREG
  wreg = 0xE3;
  //Set content of target file reg
  fileRegisters[0xCD]  = 0x00;
  fileRegisters[0x4CD] = 0x00;
  fileRegisters[0xFCD] = 0xAA;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xAA, fileRegisters[0xFCD]);
  TEST_ASSERT_EQUAL_HEX8(0xAB, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_N, status);
}

//  0010 01da ffff ffff
//incf   0x38, f, BANKED   ==> 0010 1011 0011 1000(0x2B38)
void test_executeInstruction_given_0x2B38_expect_incf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x38, 0x2B, 0x00, 0xff};
  //Set BSR
  bsr = 0x1;
  //Set WREG
  wreg = 0xFE;
  //Set content of target file reg
  fileRegisters[0x38]  = 0x00;
  fileRegisters[0x138] = 0x23;
  fileRegisters[0xF38] = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x24, fileRegisters[0x138]);
  TEST_ASSERT_EQUAL_HEX8(0xFE, wreg);
  TEST_ASSERT_EQUAL_HEX8(0x00, status);
}

//  0010 01da ffff ffff
//incf   0xFF, w, BANKED   ==> 0010 1001 1111 1111(0x29FF)
void test_executeInstruction_given_0x29FF_expect_incf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0xFF, 0x29, 0x00, 0xFE};
  //Set BSR
  bsr = 0xE;
  //Set WREG
  wreg = 0x2B;
  //Set content of target file reg
  fileRegisters[0xFF]  = 0x00;
  fileRegisters[0xEFF] = 0xD0;
  fileRegisters[0xFFF] = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xD0, fileRegisters[0xEFF]);
  TEST_ASSERT_EQUAL_HEX8(0xD1, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_N, status);
}

//----------------------------TEST CLRF---------------------------------

/*
Bank          (a):    0 ==> ACCESS BANK, 1 ==> BANKED
File Register (f):    range from 0 to 255
*/

//  0110 101a ffff ffff
//clrf   0x2E, ACCESS   ==> 0110 1010 0010 1110(0x6A2E)
void test_executeInstruction_given_0x6A2E_expect_clrf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x2E, 0x6A, 0x00, 0xff};
  //Set WREG
  wreg = 0x1F;
  //Set content of target file reg
  fileRegisters[0x2E]  = 0x8D;
  fileRegisters[0x12E] = 0x33;
  fileRegisters[0xF2E] = 0x44;
  //Clear the status register for testing
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x00, fileRegisters[0x2E]);
  TEST_ASSERT_EQUAL_HEX8(0x33, fileRegisters[0x12E]);
  TEST_ASSERT_EQUAL_HEX8(0x44, fileRegisters[0xF2E]);
  TEST_ASSERT_EQUAL_HEX8(0x1F, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_Z, status);
}

//  0110 101a ffff ffff
//clrf   0x9F, ACCESS   ==> 0110 1010 1001 1111(0x6A9F)
void test_executeInstruction_given_0x6A9F_expect_clrf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x9F, 0x6A, 0x00, 0xff};
  //Set WREG
  wreg = 0xF0;
  //Set content of target file reg
  fileRegisters[0x9F]  = 0x4D;
  fileRegisters[0x69F] = 0x33;
  fileRegisters[0xF9F] = 0x44;
  //Clear the status register for testing
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x00, fileRegisters[0xF9F]);
  TEST_ASSERT_EQUAL_HEX8(0x33, fileRegisters[0x69F]);
  TEST_ASSERT_EQUAL_HEX8(0x4D, fileRegisters[0x9F]);
  TEST_ASSERT_EQUAL_HEX8(0xF0, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_Z, status);
}

//  0110 101a ffff ffff
//clrf   0xE8, BANKED   ==> 0110 1011 1110 1000(0x6BE8)
void test_executeInstruction_given_0x6B28_expect_clrf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x28, 0x6B, 0x00, 0xff};
  //Set BSR
  bsr = 0xA;
  //Set WREG
  wreg = 0x12;
  //Set content of target file reg
  fileRegisters[0x28]  = 0x11;
  fileRegisters[0xA28] = 0x23;
  fileRegisters[0xF28] = 0x55;
  //Clear the status register for testing
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x00, fileRegisters[0xA28]);
  TEST_ASSERT_EQUAL_HEX8(0x11, fileRegisters[0x28]);
  TEST_ASSERT_EQUAL_HEX8(0x55, fileRegisters[0xF28]);
  TEST_ASSERT_EQUAL_HEX8(0x12, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_Z, status);
}

//----------------------------TEST BSF---------------------------------

