pang623/PIC18simulator/test/test_PIC18sim.c
/*
Bit           (b):    range from 0 to 7
Bank          (a):    0 ==> ACCESS BANK, 1 ==> BANKED
File Register (f):    range from 0 to 255
*/

//  1000 bbba ffff ffff
//bsf   0x3A, 5, ACCESS  ==> 1000 1010 0011 1010(0x8A3A)
//bit set 0 ==> 1
void test_executeInstruction_given_0x8A3A_expect_bsf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x3A, 0x8A, 0x00, 0xff};

  //Set content of target file reg
  fileRegisters[0x3A]  = 0x1F;
  fileRegisters[0x43A] = 0x33;
  fileRegisters[0xF3A] = 0x44;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x3F, fileRegisters[0x3A]);
  TEST_ASSERT_EQUAL_HEX8(0x33, fileRegisters[0x43A]);
  TEST_ASSERT_EQUAL_HEX8(0x44, fileRegisters[0xF3A]);
}

//  1000 bbba ffff ffff
//bsf   0x05, 1, ACCESS  ==> 1000 0010 0000 0101(0x8205)
//bit set 1 ==> 1
void test_executeInstruction_given_0x8205_expect_bsf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x05, 0x82, 0x00, 0xff};

  //Set content of target file reg
  fileRegisters[0x05]  = 0xBA;
  fileRegisters[0x105] = 0x11;
  fileRegisters[0xF05] = 0x55;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xBA, fileRegisters[0x05]);
  TEST_ASSERT_EQUAL_HEX8(0x11, fileRegisters[0x105]);
  TEST_ASSERT_EQUAL_HEX8(0x55, fileRegisters[0xF05]);
}

//  1000 bbba ffff ffff
//bsf   0xA0, 7, ACCESS  ==> 1000 1110 1010 0000(0x8EA0)
//bit set 0 ==> 1
void test_executeInstruction_given_0x8EA0_expect_bsf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0xA0, 0x8E, 0x00, 0xff};

  //Set content of target file reg
  fileRegisters[0xA0]  = 0xB2;
  fileRegisters[0x6A0] = 0xC5;
  fileRegisters[0xFA0] = 0x7D;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xFD, fileRegisters[0xFA0]);
  TEST_ASSERT_EQUAL_HEX8(0xC5, fileRegisters[0x6A0]);
  TEST_ASSERT_EQUAL_HEX8(0xB2, fileRegisters[0xA0]);
}

//  1000 bbba ffff ffff
//bsf   0xDC, 0, ACCESS  ==> 1000 0000 1101 1100(0x80DC)
//bit set 1 ==> 1
void test_executeInstruction_given_0x80DC_expect_bsf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0xDC, 0x80, 0x00, 0xff};

  //Set content of target file reg
  fileRegisters[0xDC]  = 0x68;
  fileRegisters[0x7DC] = 0x20;
  fileRegisters[0xFDC] = 0x55;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x55, fileRegisters[0xFDC]);
  TEST_ASSERT_EQUAL_HEX8(0x20, fileRegisters[0x7DC]);
  TEST_ASSERT_EQUAL_HEX8(0x68, fileRegisters[0xDC]);
}

//  1000 bbba ffff ffff
//bsf   0x9A, 6, BANKED  ==> 1000 1101 1001 1010(0x8D9A)
//bit set 0 ==> 1
void test_executeInstruction_given_0x8D9A_expect_bsf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x9A, 0x8D, 0x00, 0xff};
  //Set BSR
  bsr = 0xD;
  //Set content of target file reg
  fileRegisters[0x9A]  = 0xF3;
  fileRegisters[0xD9A] = 0x9C;
  fileRegisters[0xF9A] = 0x82;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xDC, fileRegisters[0xD9A]);
  TEST_ASSERT_EQUAL_HEX8(0xF3, fileRegisters[0x9A]);
  TEST_ASSERT_EQUAL_HEX8(0x82, fileRegisters[0xF9A]);
}

//  1000 bbba ffff ffff
//bsf   0xBD, 3, BANKED  ==> 1000 0111 1011 1101(0x87BD)
//bit set 1 ==> 1
void test_executeInstruction_given_0x87BD_expect_bsf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0xBD, 0x87, 0x00, 0xff};
  //Set BSR
  bsr = 0x8;
  //Set content of target file reg
  fileRegisters[0xBD]  = 0x36;
  fileRegisters[0x8BD] = 0x1E;
  fileRegisters[0xFBD] = 0xF1;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x1E, fileRegisters[0x8BD]);
  TEST_ASSERT_EQUAL_HEX8(0xF1, fileRegisters[0xFBD]);
  TEST_ASSERT_EQUAL_HEX8(0x36, fileRegisters[0xBD]);
}

//----------------------------TEST BCF---------------------------------

/*
Bit           (b):    range from 0 to 7
Bank          (a):    0 ==> ACCESS BANK, 1 ==> BANKED
File Register (f):    range from 0 to 255
*/

//  1001 bbba ffff ffff
//bcf   0x56, 4, ACCESS  ==> 1001 1000 0101 0110(0x9856)
//bit clr 1 ==> 0
void test_executeInstruction_given_0x9856_expect_bcf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x56, 0x98, 0x00, 0xff};

  //Set content of target file reg
  fileRegisters[0x56]  = 0x3C;
  fileRegisters[0xA56] = 0x65;
  fileRegisters[0xF56] = 0xAA;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x2C, fileRegisters[0x56]);
  TEST_ASSERT_EQUAL_HEX8(0x65, fileRegisters[0xA56]);
  TEST_ASSERT_EQUAL_HEX8(0xAA, fileRegisters[0xF56]);
}

//  1001 bbba ffff ffff
//bcf   0x4F, 5, ACCESS  ==> 1001 1010 0100 1111(0x9A4F)
//bit clr 0 ==> 0
void test_executeInstruction_given_0x9A4F_expect_bcf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x4F, 0x9A, 0x00, 0xff};

  //Set content of target file reg
  fileRegisters[0x4F]  = 0x8E;
  fileRegisters[0xD4F] = 0x01;
  fileRegisters[0xF4F] = 0x90;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x8E, fileRegisters[0x4F]);
  TEST_ASSERT_EQUAL_HEX8(0x01, fileRegisters[0xD4F]);
  TEST_ASSERT_EQUAL_HEX8(0x90, fileRegisters[0xF4F]);
}

//  1001 bbba ffff ffff
//bcf   0x78, 2, ACCESS  ==> 1001 0100 0111 1000(0x9478)
//bit clr 1 ==> 0
void test_executeInstruction_given_0x9478_expect_bcf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x78, 0x94, 0x00, 0xff};

  //Set content of target file reg
  fileRegisters[0x78]  = 0xD2;
  fileRegisters[0x578] = 0x1B;
  fileRegisters[0xF78] = 0xC7;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xC3, fileRegisters[0xF78]);
  TEST_ASSERT_EQUAL_HEX8(0x1B, fileRegisters[0x578]);
  TEST_ASSERT_EQUAL_HEX8(0xD2, fileRegisters[0x78]);
}

