pang623/PIC18simulator/test/test_PIC18sim.c
//  1001 bbba ffff ffff
//bcf   0xFA, 3, ACCESS  ==> 1001 0110 1111 1010(0x96FA)
//bit clr 0 ==> 0
void test_executeInstruction_given_0x96FA_expect_bcf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0xFA, 0x96, 0x00, 0xff};

  //Set content of target file reg
  fileRegisters[0xFA]  = 0x07;
  fileRegisters[0x9FA] = 0xA3;
  fileRegisters[0xFFA] = 0xF7;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xF7, fileRegisters[0xFFA]);
  TEST_ASSERT_EQUAL_HEX8(0xA3, fileRegisters[0x9FA]);
  TEST_ASSERT_EQUAL_HEX8(0x07, fileRegisters[0xFA]);
}

//  1001 bbba ffff ffff
//bcf   0x37, 7, BANKED  ==> 1001 1111 0011 0111(0x9F37)
//bit clr 1 ==> 0
void test_executeInstruction_given_0x9F37_expect_bcf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x37, 0x9F, 0x00, 0xff};
  //Set BSR
  bsr = 0xE;
  //Set content of target file reg
  fileRegisters[0x37]  = 0xEE;
  fileRegisters[0xE37] = 0xC6;
  fileRegisters[0xF37] = 0x0F;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x46, fileRegisters[0xE37]);
  TEST_ASSERT_EQUAL_HEX8(0x0F, fileRegisters[0xF37]);
  TEST_ASSERT_EQUAL_HEX8(0xEE, fileRegisters[0x37]);
}

//  1001 bbba ffff ffff
//bcf   0xBE, 1, BANKED  ==> 1001 0011 1011 1110(0x93BE)
//bit clr 0 ==> 0
void test_executeInstruction_given_0x93BE_expect_bcf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0xBE, 0x93, 0x00, 0xff};
  //Set BSR
  bsr = 0x1;
  //Set content of target file reg
  fileRegisters[0xBE]  = 0xF4;
  fileRegisters[0x1BE] = 0x79;
  fileRegisters[0xFBE] = 0x32;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x79, fileRegisters[0x1BE]);
  TEST_ASSERT_EQUAL_HEX8(0x32, fileRegisters[0xFBE]);
  TEST_ASSERT_EQUAL_HEX8(0xF4, fileRegisters[0xBE]);
}

//----------------------------TEST BN---------------------------------

/*
Relative address    (n):  -128 to 127

Mnemonic: bn n
Opcode: 1110 0110 nnnn nnnn

  n is the number of lines of instruction that need to be jumped
  
*/

//test for jumping forward
//  PC
// 0x54   bn   0x5C   ==> 1110 0110 0000 0011(0xE603)
void test_executeInstruction_given_0xE603_and_PC_at_0x54_and_NEGATIVE_bit_is_high_expect_bn_called_and_PC_is_0x5C(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x03, 0xE6, 0x00, 0xff};
  //Set PCL
  pcl = 0x54;
  //Set status flag (negative)
  status = STATUS_N;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x5C, pcl);
  TEST_ASSERT_EQUAL_HEX8(STATUS_N, status);     //test that bn do not affect status flags
}

//test for jumping forward (whole range)
//  PC
// 0x00   bn   0xFE   ==> 1110 0110 0111 1110(0xE67E)
void test_executeInstruction_given_0xE67E_and_PC_at_0x00_and_NEGATIVE_bit_is_high_expect_bn_called_and_PC_is_0xFE(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x7E, 0xE6, 0x00, 0xff};
  //Set PCL
  pcl = 0x00;
  //Set status flag (negative)
  status = STATUS_N;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xFE, pcl);
  TEST_ASSERT_EQUAL_HEX8(STATUS_N, status);     //test that bn do not affect status flags
}

//test for jumping backwards
//  PC
// 0x6E   bn   0x20   ==> 1110 0110 1101 1000(0xE6D8)
void test_executeInstruction_given_0xE6D8_and_PC_at_0x6E_and_NEGATIVE_bit_is_high_expect_bn_called_and_PC_is_0x20(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0xD8, 0xE6, 0x00, 0xff};
  //Set PCL
  pcl = 0x6E;
  //Set status flag (negative)
  status = STATUS_N;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x20, pcl);
  TEST_ASSERT_EQUAL_HEX8(STATUS_N, status);     //test that bn do not affect status flags
}

//test for jumping backwards (whole range)
//  PC
// 0xFE   bn   0x00   ==> 1110 0110 1000 0000(0xE680)
void test_executeInstruction_given_0xE680_and_PC_at_0xFE_and_NEGATIVE_bit_is_high_expect_bn_called_and_PC_is_0x00(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x80, 0xE6, 0x00, 0xff};
  //Set PCL
  pcl = 0xFE;
  //Set status flag (negative)
  status = STATUS_N;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x00, pcl);
  TEST_ASSERT_EQUAL_HEX8(STATUS_N, status);     //test that bn do not affect status flags
}

//test when NEGATIVE bit is low, BN will not jump to target address, it continues to the next instruction instead, which causes PC to +2
//  PC
// 0xB2   bn   0xC4   ==> 1110 0110 0000 1000(0xE608)
void test_executeInstruction_given_0xE608_and_PC_at_0xB2_and_NEGATIVE_bit_is_low_expect_bn_called_and_PC_is_0xB4(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x08, 0xE6, 0x00, 0xff};
  //Set PCL
  pcl = 0xB2;
  //Clear status flag (negative)
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xB4, pcl);
  TEST_ASSERT_EQUAL_HEX8(0x00, status);         //test that bn do not affect status flags
}

//----------------------------TEST BNZ---------------------------------

/*
Relative address    (n):  -128 to 127

Mnemonic: bnz n
Opcode: 1110 0001 nnnn nnnn

  n is the number of lines of instruction that need to be jumped
  
*/

//test for jumping forward
//  PC
// 0x8E   bnz   0xA4   ==> 1110 0001 0000 1010(0xE10A)
void test_executeInstruction_given_0xE10A_and_PC_at_0x8E_and_ZERO_bit_is_low_expect_bnz_called_and_PC_is_0xA4(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x0A, 0xE1, 0x00, 0xff};
  //Set PCL
  pcl = 0x8E;
  //Clear status flag (zero)
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xA4, pcl);
  TEST_ASSERT_EQUAL_HEX8(0x00, status);     //test that bnz do not affect status flags
}

//test for jumping forward (whole range)
//  PC
// 0x00   bnz   0xFE   ==> 1110 0001 0111 1110(0xE17E)
void test_executeInstruction_given_0xE17E_and_PC_at_0x00_and_ZERO_bit_is_low_expect_bnz_called_and_PC_is_0xFE(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x7E, 0xE1, 0x00, 0xff};
  //Set PCL
  pcl = 0x00;
  //Clear status flag (zero)
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xFE, pcl);
  TEST_ASSERT_EQUAL_HEX8(0x00, status);     //test that bnz do not affect status flags
}

//test for jumping backwards
//  PC
// 0xFA   bnz   0xDC   ==> 1110 0001 1111 0000(0xE1F0)
void test_executeInstruction_given_0xE1F0_and_PC_at_0xFA_and_ZERO_bit_is_low_expect_bnz_called_and_PC_is_0xDC(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0xF0, 0xE1, 0x00, 0xff};
  //Set PCL
  pcl = 0xFA;
  //Clear status flag (zero)
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xDC, pcl);
  TEST_ASSERT_EQUAL_HEX8(0x00, status);     //test that bnz do not affect status flags
}

//test for jumping backwards (whole range)
//  PC
// 0xFE   bnz   0x00   ==> 1110 0001 1000 0000(0xE180)
void test_executeInstruction_given_0xE180_and_PC_at_0xFE_and_ZERO_bit_is_low_expect_bnz_called_and_PC_is_0x00(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x80, 0xE1, 0x00, 0xff};
  //Set PCL
  pcl = 0xFE;
  //Clear status flag (zero)
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x00, pcl);
  TEST_ASSERT_EQUAL_HEX8(0x00, status);     //test that bnz do not affect status flags
}

//test when ZERO bit is high, BNZ will not jump to target address, it continues to the next instruction instead, which causes PC to +2
//  PC
// 0xB2   bnz   0xC4   ==> 1110 0110 0000 1000(0xE108)
void test_executeInstruction_given_0xE108_and_PC_at_0xB2_and_ZERO_bit_is_high_expect_bnz_called_and_PC_is_0xB4(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x08, 0xE1, 0x00, 0xff};
  //Set PCL
  pcl = 0xB2;
  //Set status flag (zero)
  status = STATUS_Z;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xB4, pcl);
  TEST_ASSERT_EQUAL_HEX8(STATUS_Z, status);         //test that bnz do not affect status flags
}




//----------------------------TEST BNOV---------------------------------

//----------------------------TEST MOVWF---------------------------------

