pang623/PIC18simulator/test/test_PIC18sim.c
/*
Bank          (a):    0 ==> ACCESS BANK, 1 ==> BANKED
File Register (f):    range from 0 to 255

Mnemonic: movwf f, a
Opcode: 0110 111a ffff ffff
*/

//movwf   0x16, ACCESS   ==> 0110 1110 0001 0110(0x6E16)
void test_executeInstruction_given_0x6E16_expect_movwf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x16, 0x6E, 0x00, 0xff};
  //Set WREG
  wreg = 0x5A;
  //Set content of target file reg
  fileRegisters[0x16] = 0xD3;
  fileRegisters[0x716] = 0x00;
  fileRegisters[0xF16] = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array address
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x5A, fileRegisters[0x16]);
  TEST_ASSERT_EQUAL_HEX8(0X00, fileRegisters[0x716]);
  TEST_ASSERT_EQUAL_HEX8(0X00, fileRegisters[0xF16]);
  TEST_ASSERT_EQUAL_HEX8(0x5A, wreg);
}

//movwf   0xB9, ACCESS   ==> 0110 1110 1011 1001(0x6EB9)
void test_executeInstruction_given_0x6EB9_expect_movwf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0xB9, 0x6E, 0x00, 0xff};
  //Set WREG
  wreg = 0x66;
  //Set content of target file reg
  fileRegisters[0xB9] = 0x00;
  fileRegisters[0x3B9] = 0x00;
  fileRegisters[0xFB9] = 0x86;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array address
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x66, fileRegisters[0xFB9]);
  TEST_ASSERT_EQUAL_HEX8(0X00, fileRegisters[0x3B9]);
  TEST_ASSERT_EQUAL_HEX8(0X00, fileRegisters[0xB9]);
  TEST_ASSERT_EQUAL_HEX8(0x66, wreg);
}

//movwf   0xEA, BANKED   ==> 0110 1111 1110 1010(0x6FEA)
void test_executeInstruction_given_0x6FEA_expect_movwf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0xEA, 0x6F, 0x00, 0xff};
  //Set BSR
  bsr = 0xD;
  //Set WREG
  wreg = 0x51;
  //Set content of target file reg
  fileRegisters[0xEA] = 0x00;
  fileRegisters[0xDEA] = 0x7B;
  fileRegisters[0xFEA] = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array address
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x51, fileRegisters[0xDEA]);
  TEST_ASSERT_EQUAL_HEX8(0X00, fileRegisters[0xFEA]);
  TEST_ASSERT_EQUAL_HEX8(0X00, fileRegisters[0xEA]);
  TEST_ASSERT_EQUAL_HEX8(0x51, wreg);
}

//----------------------------TEST ANDWF---------------------------------

/*
Direction     (d):    0 ==> WREG , 1 ==> file register
Bank          (a):    0 ==> ACCESS BANK, 1 ==> BANKED
File Register (f):    range from 0 to 255

Mnemonic: andwf f, d, a
Opcode: 0001 01da ffff ffff
*/

//  0001 01da ffff ffff
//andwf   0x02, f, ACCESS   ==> 0001 0110 0000 0010(0x1602)
void test_executeInstruction_given_0x1602_expect_andwf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x02, 0x16, 0x00, 0xff};
  //Set WREG
  wreg = 0x9E;
  //Set content of target file reg
  fileRegisters[0x02]  = 0xE7;
  fileRegisters[0xC02] = 0xFF;
  fileRegisters[0xF02] = 0xFF;
  //Clear the status register for testing
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x86, fileRegisters[0x02]);
  TEST_ASSERT_EQUAL_HEX8(0xFF, fileRegisters[0xC02]);
  TEST_ASSERT_EQUAL_HEX8(0xFF, fileRegisters[0xF02]);
  TEST_ASSERT_EQUAL_HEX8(0x9E, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_N, status);
}

//  0001 01da ffff ffff
//andwf   0x5F, w, ACCESS   ==> 0001 0100 0101 1111(0x145F)
void test_executeInstruction_given_0x145F_expect_andwf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x5F, 0x14, 0x00, 0xff};
  //Set WREG
  wreg = 0x39;
  //Set content of target file reg
  fileRegisters[0x5F]  = 0x7C;
  fileRegisters[0x25F] = 0xFF;
  fileRegisters[0xF5F] = 0xFF;
  //Clear the status register for testing
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x7C, fileRegisters[0x5F]);
  TEST_ASSERT_EQUAL_HEX8(0x38, wreg);
  TEST_ASSERT_EQUAL_HEX8(0x00, status);
}

//  0001 01da ffff ffff
//andwf   0x88, f, ACCESS   ==> 0001 0110 1000 1000(0x1688)
void test_executeInstruction_given_0x1688_expect_andwf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x88, 0x16, 0x00, 0xff};
  //Set WREG
  wreg = 0xAA;
  //Set content of target file reg
  fileRegisters[0x88]  = 0xFF;
  fileRegisters[0x188] = 0xFF;
  fileRegisters[0xF88] = 0x55;
  //Clear the status register for testing
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x00, fileRegisters[0xF88]);
  TEST_ASSERT_EQUAL_HEX8(0xFF, fileRegisters[0x188]);
  TEST_ASSERT_EQUAL_HEX8(0xFF, fileRegisters[0x88]);
  TEST_ASSERT_EQUAL_HEX8(0xAA, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_Z, status);
}

//  0001 01da ffff ffff
//andwf   0xFF, w, ACCESS   ==> 0001 0100 1111 1111(0x14FF)
void test_executeInstruction_given_0x14FF_expect_andwf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0xFF, 0x14, 0x00, 0xA2};
  //Set WREG
  wreg = 0xD2;
  //Set content of target file reg
  fileRegisters[0xFF]  = 0xFF;
  fileRegisters[0x9FF] = 0xFF;
  fileRegisters[0xFFF] = 0xED;
  //Clear the status register for testing
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xED, fileRegisters[0xFFF]);
  TEST_ASSERT_EQUAL_HEX8(0xC0, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_N, status);
}

//  0001 01da ffff ffff
//andwf   0x00, f, BANKED   ==> 0001 0111 0000 0000(0x1700)
void test_executeInstruction_given_0x1700_expect_andwf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x00, 0x17, 0x09, 0xff};
  //Set BSR
  bsr = 0xE;
  //Set WREG
  wreg = 0x39;
  //Set content of target file reg
  fileRegisters[0x00]  = 0xFF;
  fileRegisters[0xE00] = 0xC6;
  fileRegisters[0xF00] = 0xFF;
  //Clear the status register for testing
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x00, fileRegisters[0xE00]);
  TEST_ASSERT_EQUAL_HEX8(0xFF, fileRegisters[0xF00]);
  TEST_ASSERT_EQUAL_HEX8(0xFF, fileRegisters[0x00]);
  TEST_ASSERT_EQUAL_HEX8(0x39, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_Z, status);
}

//  0001 01da ffff ffff
//andwf   0x48, w, BANKED   ==> 0001 0101 0100 1000(0x1548)
void test_executeInstruction_given_0x1548_expect_andwf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x48, 0x15, 0x00, 0xff};
  //Set BSR
  bsr = 0x2;
  //Set WREG
  wreg = 0x93;
  //Set content of target file reg
  fileRegisters[0x48]  = 0xFF;
  fileRegisters[0x248] = 0x1A;
  fileRegisters[0xF48] = 0xFF;
  //Clear the status register for testing
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);       //if is array, its passing in array
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x1A, fileRegisters[0x248]);
  TEST_ASSERT_EQUAL_HEX8(0x12, wreg);
  TEST_ASSERT_EQUAL_HEX8(0x00, status);
}

//----------------------------TEST RLCF---------------------------------

