pang623/PIC18simulator/test/test_PIC18sim.c
/*
Direction     (d):    0 ==> WREG , 1 ==> file register
Bank          (a):    0 ==> ACCESS BANK, 1 ==> BANKED
File Register (f):    range from 0 to 255

Mnemonic: rlcf f, d, a
Opcode: 0011 01da ffff ffff
*/

/*
*            0x30      C    wreg
* before   10010111    0    0x86
* after    00101110    1    0x86
*/

//  0011 01da ffff ffff
//rlcf   0x30, f, ACCESS   ==> 0011 0110 0011 0000(0x3630)
void test_executeInstruction_given_0x3630_expect_rlcf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x30, 0x36, 0x00, 0xff};
  //Set WREG
  wreg = 0x86;
  //Set content of target file reg
  fileRegisters[0x30]  = 0x97;
  fileRegisters[0xA30] = 0x12;
  fileRegisters[0xF30] = 0x21;
  //Clear the status register for testing
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x2E, fileRegisters[0x30]);
  TEST_ASSERT_EQUAL_HEX8(0x12, fileRegisters[0xA30]);
  TEST_ASSERT_EQUAL_HEX8(0x21, fileRegisters[0xF30]);
  TEST_ASSERT_EQUAL_HEX8(0x86, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_C, status);
}

/*
*            0x4F      C    wreg
* before   00010111    0    0x98
* after    00010111    0    00101110
*/

//  0011 01da ffff ffff
//rlcf   0x4F, w, ACCESS   ==> 0011 0100 0100 1111(0x344F)
void test_executeInstruction_given_0x344F_expect_rlcf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x4F, 0x34, 0x00, 0xff};
  //Set WREG
  wreg = 0x98;
  //Set content of target file reg
  fileRegisters[0x4F]  = 0x17;
  fileRegisters[0x24F] = 0x12;
  fileRegisters[0xF4F] = 0x21;
  //Clear the status register for testing
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x17, fileRegisters[0x4F]);
  TEST_ASSERT_EQUAL_HEX8(0x12, fileRegisters[0x24F]);
  TEST_ASSERT_EQUAL_HEX8(0x21, fileRegisters[0xF4F]);
  TEST_ASSERT_EQUAL_HEX8(0x2E, wreg);
  TEST_ASSERT_EQUAL_HEX8(0x00, status);
}

/*
*           0xF68      C    wreg
* before   10010111    1    0x01
* after    00101111    1    0X01
*/

//  0011 01da ffff ffff
//rlcf   0x68, f, ACCESS   ==> 0011 0110 0110 1000(0x3668)
void test_executeInstruction_given_0x3668_expect_rlcf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x68, 0x36, 0x00, 0xff};
  //Set WREG
  wreg = 0x01;
  //Set content of target file reg
  fileRegisters[0x68]  = 0x08;
  fileRegisters[0x368] = 0x12;
  fileRegisters[0xF68] = 0x97;
  //Clear the status register for testing
  status = 0x01;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x2F, fileRegisters[0xF68]);
  TEST_ASSERT_EQUAL_HEX8(0x12, fileRegisters[0x368]);
  TEST_ASSERT_EQUAL_HEX8(0x08, fileRegisters[0x68]);
  TEST_ASSERT_EQUAL_HEX8(0x01, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_C, status);
}

/*
*           0xFF3      C    wreg
* before   00010111    1    0x50
* after    00010111    0    00101111
*/

//  0011 01da ffff ffff
//rlcf   0xF3, w, ACCESS   ==> 0011 0100 1111 0011(0x34F3)
void test_executeInstruction_given_0x34F3_expect_rlcf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0xF3, 0x34, 0x00, 0xff};
  //Set WREG
  wreg = 0x50;
  //Set content of target file reg
  fileRegisters[0xF3]  = 0x76;
  fileRegisters[0x7F3] = 0x10;
  fileRegisters[0xFF3] = 0x17;
  //Clear the status register for testing
  status = 0x01;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x17, fileRegisters[0xFF3]);
  TEST_ASSERT_EQUAL_HEX8(0x10, fileRegisters[0x7F3]);
  TEST_ASSERT_EQUAL_HEX8(0x76, fileRegisters[0xF3]);
  TEST_ASSERT_EQUAL_HEX8(0x2F, wreg);
  TEST_ASSERT_EQUAL_HEX8(0x00, status);
}

/*
*           0xC6D      C    wreg
* before   00000000    0    0x42
* after    00000000    0    0x42
*/

//  0011 01da ffff ffff
//rlcf   0x6D, f, BANKED   ==> 0011 0111 0110 1101(0x376D)
void test_executeInstruction_given_0x376D_expect_rlcf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x6D, 0x37, 0x00, 0xff};
  //Set BSR
  bsr = 0xC;
  //Set WREG
  wreg = 0x42;
  //Set content of target file reg
  fileRegisters[0x6D]  = 0x87;
  fileRegisters[0xC6D] = 0x00;
  fileRegisters[0xF6D] = 0x71;
  //Clear the status register for testing
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0x00, fileRegisters[0xC6D]);
  TEST_ASSERT_EQUAL_HEX8(0x71, fileRegisters[0xF6D]);
  TEST_ASSERT_EQUAL_HEX8(0x87, fileRegisters[0x6D]);
  TEST_ASSERT_EQUAL_HEX8(0x42, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_Z, status);
}

/*
*           0x123      C    wreg
* before   11111111    0    0x39
* after    11111111    1    11111110
*/

//  0011 01da ffff ffff
//rlcf   0x23, w, BANKED   ==> 0011 0101 0010 0011(0x3523)
void test_executeInstruction_given_0x3523_expect_rlcf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x23, 0x35, 0x00, 0xff};
  //Set BSR
  bsr = 0x1;
  //Set WREG
  wreg = 0x39;
  //Set content of target file reg
  fileRegisters[0x23]  = 0x09;
  fileRegisters[0x123] = 0xFF;
  fileRegisters[0xF23] = 0x38;
  //Clear the status register for testing
  status = 0x00;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xFF, fileRegisters[0x123]);
  TEST_ASSERT_EQUAL_HEX8(0x38, fileRegisters[0xF23]);
  TEST_ASSERT_EQUAL_HEX8(0x09, fileRegisters[0x23]);
  TEST_ASSERT_EQUAL_HEX8(0xFE, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_N | STATUS_C, status);
}

//EXTRA

/*
*           0xE00      C    wreg
* before   01111111    1    0x9A
* after    11111111    0    0x9A
*/

//  0011 01da ffff ffff
//rlcf   0x00, f, BANKED   ==> 0011 0111 0000 0000(0x3700)
void test_executeInstruction_given_0x3700_expect_rlcf_called(void) {
  //Setup test fixture
  uint8_t codeMemory[] = {0x00, 0x37, 0xE2, 0xff};
  //Set BSR
  bsr = 0xE;
  //Set WREG
  wreg = 0x9A;
  //Set content of target file reg
  fileRegisters[0x00]  = 0x5B;
  fileRegisters[0xE00] = 0x7F;
  fileRegisters[0xF00] = 0x11;
  //Clear the status register for testing
  status = 0x01;
  //Run the code under test
  executeInstruction(codeMemory);
  //Verify the code has expected output
  TEST_ASSERT_EQUAL_HEX8(0xFF, fileRegisters[0xE00]);
  TEST_ASSERT_EQUAL_HEX8(0x11, fileRegisters[0xF00]);
  TEST_ASSERT_EQUAL_HEX8(0x5B, fileRegisters[0x00]);
  TEST_ASSERT_EQUAL_HEX8(0x9A, wreg);
  TEST_ASSERT_EQUAL_HEX8(STATUS_N, status);
}